app/controllers/todos_controller.rb

  def show
    @todo = Todo.find(params[:id])
---
SELECT * FROM "todos" WHERE ("todos"."id" = 1)

  def create
    @todo = Todo.new(params[:todo])

      if @todo.save
---
INSERT INTO "todos" ("updated_at", "title", "notes", "due", "created_at") VALUES('2009-02-10 20:13:19', 'muis schoonmaken', '', '2009-02-10', '2009-02-10 20:13:19')